TASK 1

In [13]:
import pandas as pd

fulldata_df = pd.read_csv('./online_store_customer_data.csv')
fulldata_df.head(3)

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
0,1/1/2019,151200,Female,19.0,Single,Kansas,Basic,Unemployment,Other,1.0,2051.36
1,1/1/2019,151201,Male,49.0,Single,Illinois,Basic,self-employed,Card,0.0,544.04
2,1/1/2019,151202,Male,63.0,Married,New Mexico,Basic,workers,PayPal,1.0,1572.60

In [14]:
shape = fulldata_df.shape
shape

(2512, 11)

In [15]:
description = fulldata_df.describe()
description

       Transaction_ID          Age      Referal  Amount_spent
count     2512.000000  2470.000000  2357.000000   2270.000000
mean    152443.931131    46.637652     0.652100   1418.422577
std        724.580482    18.186277     0.476405    878.507451
min     151200.000000    15.000000     0.000000      2.090000
25%     151815.750000    32.000000     0.000000    678.192500
50%     152443.500000    47.000000     1.000000   1341.435000
75%     153071.250000    62.000000     1.000000   2038.102500
max     153699.000000    78.000000     1.000000   2999.980000

In [16]:
info = fulldata_df.info()
info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2512 entries, 0 to 2511
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction_date  2512 non-null   object
 1   Transaction_ID    2512 non-null   int64
 2   Gender            2484 non-null   object
 3   Age               2470 non-null   float64
 4   Marital_status    2512 non-null   object
 5   State_names       2512 non-null   object
 6   Segment           2512 non-null   object
 7   Employees_status  2486 non-null   object
 8   Payment_method    2512 non-null   object
 9   Referal           2357 non-null   float64
 10  Amount_spent      2270 non-null   float64
dtypes: float64(3), int64(1), object(7)
memory usage: 216.0+ KB

In [17]:
value_count = fulldata_df[['Gender' , 'Marital_status' , 'Payment_method']].value_counts()
value_count

Gender  Marital_status  Payment_method
Female  Married         PayPal            359
Male    Married         PayPal            303
Female  Single          PayPal            255
        Married         Card              243
Male    Single          PayPal            239
        Married         Card              193
Female  Married         Other             186
        Single          Card              186
Male    Married         Other             172
Female  Single          Other             127
Male    Single          Card              117
                        Other             104
Name: count, dtype: int64

In [18]:
missing_values = fulldata_df.isna().sum()
missing_values

Transaction_date      0
Transaction_ID        0
Gender               28
Age                  42
Marital_status        0
State_names           0
Segment               0
Employees_status     26
Payment_method        0
Referal             155
Amount_spent        242
dtype: int64

In [19]:
missing_null_value = fulldata_df.isnull().sum()
missing_null_value

Transaction_date      0
Transaction_ID        0
Gender               28
Age                  42
Marital_status        0
State_names           0
Segment               0
Employees_status     26
Payment_method        0
Referal             155
Amount_spent        242
dtype: int64

In [20]:
# the difference between the isna and the isnull is:

#isna() is used to detect the missing values 
# in the cells of the pandas data frame. It returns a data frame of the same size with the values masked as True for NA values and False for non-NA values.
#  isnull() is also used to identify or detect the missing values in the data frame. It is just an alias for isna() method.

In [21]:
temp = fulldata_df.drop(columns=['Amount_spent'], axis=1)
temp

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal
0,1/1/2019,151200,Female,19.0,Single,Kansas,Basic,Unemployment,Other,1.0
1,1/1/2019,151201,Male,49.0,Single,Illinois,Basic,self-employed,Card,0.0
2,1/1/2019,151202,Male,63.0,Married,New Mexico,Basic,workers,PayPal,1.0
3,1/1/2019,151203,NaN,18.0,Single,Virginia,Platinum,workers,Card,1.0
4,1/1/2019,151204,Male,27.0,Single,Connecticut,Basic,self-employed,Card,0.0
...,...,...,...,...,...,...,...,...,...,...
2507,5/1/2021,153695,Female,57.0,Single,South Carolina,Platinum,self-employed,Card,0.0
2508,5/1/2021,153696,Female,36.0,Married,Hawaii,Silver,self-employed,PayPal,1.0
2509,5/1/2021,153697,Male,22.0,Single,South Carolina,Basic,workers,PayPal,1.0
2510,5/1/2021,153698,NaN,44.0,Single,New York,Basic,Employees,PayPal,0.0
2511,5/1/2021,153699,Male,48.0,Single,California,Silver,workers,PayPal,1.0

In [23]:
temp = fulldata_df.dropna(subset = ["Employees_status"])
temp

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
0,1/1/2019,151200,Female,19.0,Single,Kansas,Basic,Unemployment,Other,1.0,2051.36
1,1/1/2019,151201,Male,49.0,Single,Illinois,Basic,self-employed,Card,0.0,544.04
2,1/1/2019,151202,Male,63.0,Married,New Mexico,Basic,workers,PayPal,1.0,1572.60
3,1/1/2019,151203,NaN,18.0,Single,Virginia,Platinum,workers,Card,1.0,1199.79
4,1/1/2019,151204,Male,27.0,Single,Connecticut,Basic,self-employed,Card,0.0,NaN
...,...,...,...,...,...,...,...,...,...,...,...
2507,5/1/2021,153695,Female,57.0,Single,South Carolina,Platinum,self-employed,Card,0.0,150.10
2508,5/1/2021,153696,Female,36.0,Married,Hawaii,Silver,self-employed,PayPal,1.0,708.88
2509,5/1/2021,153697,Male,22.0,Single,South Carolina,Basic,workers,PayPal,1.0,2030.07
2510,5/1/2021,153698,NaN,44.0,Single,New York,Basic,Employees,PayPal,0.0,1909.77
2511,5/1/2021,153699,Male,48.0,Single,California,Silver,workers,PayPal,1.0,1073.15

In [58]:
fulldata_df = pd.read_csv('online_store_customer_data.csv')

In [59]:
mean_age = fulldata_df['Age'].mean()
mean_age

46.63765182186235

In [61]:
temp_df = fulldata_df['Age'].fillna(mean_age)
temp_df

0       19.0
1       49.0
2       63.0
3       18.0
4       27.0
        ...
2507    57.0
2508    36.0
2509    22.0
2510    44.0
2511    48.0
Name: Age, Length: 2512, dtype: float64

In [63]:
# Impute Mode in Employees_status column
mode_gen = fulldata_df['Gender'].mode().iloc[0]
mode_gen

'Female'

In [64]:
temp_df = fulldata_df['Gender'].fillna(mode_gen)
temp_df

0       Female
1         Male
2         Male
3       Female
4         Male
         ...
2507    Female
2508    Female
2509      Male
2510    Female
2511      Male
Name: Gender, Length: 2512, dtype: object